colinporth/stm32F429disco/Src/main.cpp
// main.cpp
//{{{  malloc defines
#define bigMalloc(size,tag)    pvPortMalloc(size)
#define bigFree                vPortFree

#define smallMalloc(size,tag)  malloc(size)
#define smallFree              free
//}}}
//{{{  includes
#include <stdint.h>
#include <stdlib.h>
#include <math.h>
#include <string>
#include <sstream>
#include <iostream>
#include <iomanip>
#include <map>
#include <vector>

#include "heap.h"

#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include "stm32f429i_discovery.h"

#include "fatFs.h"

#include <ft2build.h>
#include FT_FREETYPE_H
#include "FreeSansBold.h"

#include "cJpegPic.h"

#include "diskio.h"
//}}}
//{{{  clock defines
#define HSE_VALUE        ((uint32_t)8000000)
#define HSI_VALUE        ((uint32_t)16000000)
#define VECT_TAB_OFFSET  0x00
//}}}
//{{{  sdram defines
#define SDRAM_BANK1_ADDR  ((uint32_t)0xC0000000)
#define SDRAM_BANK1_LEN   ((uint32_t)0x01000000)
#define SDRAM_BANK2_ADDR  ((uint32_t)0xD0000000)
#define SDRAM_BANK2_LEN   ((uint32_t)0x00800000)

#define SDRAM_MODEREG_BURST_LENGTH_1             ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_LENGTH_2             ((uint16_t)0x0001)
#define SDRAM_MODEREG_BURST_LENGTH_4             ((uint16_t)0x0002)
#define SDRAM_MODEREG_BURST_LENGTH_8             ((uint16_t)0x0004)
#define SDRAM_MODEREG_BURST_TYPE_INTERLEAVED     ((uint16_t)0x0008)
#define SDRAM_MODEREG_CAS_LATENCY_2              ((uint16_t)0x0020)
#define SDRAM_MODEREG_CAS_LATENCY_3              ((uint16_t)0x0030)
#define SDRAM_MODEREG_WRITEBURST_MODE_SINGLE     ((uint16_t)0x0200)
//}}}
//{{{  trace defines
#define ITM_LAR_KEY   0xC5ACCE55
//{{{  ITM defines
/* ITM Trace Privilege Register Definitions */
#define ITM1_TPR_PRIVMASK_Pos                0U                                            /*!< ITM TPR: PRIVMASK Position */
#define ITM1_TPR_PRIVMASK_Msk               (0xFUL /*<< ITM1_TPR_PRIVMASK_Pos*/)            /*!< ITM TPR: PRIVMASK Mask */

/* ITM Trace Control Register Definitions */
#define ITM1_TCR_BUSY_Pos                   23U                                            /*!< ITM TCR: BUSY Position */
#define ITM1_TCR_BUSY_Msk                   (1UL << ITM1_TCR_BUSY_Pos)                      /*!< ITM TCR: BUSY Mask */

#define ITM1_TCR_TraceBusID_Pos             16U                                            /*!< ITM TCR: ATBID Position */
#define ITM1_TCR_TraceBusID_Msk             (0x7FUL << ITM1_TCR_TraceBusID_Pos)             /*!< ITM TCR: ATBID Mask */

#define ITM1_TCR_GTSFREQ_Pos                10U                                            /*!< ITM TCR: Global timestamp frequency Position */
#define ITM1_TCR_GTSFREQ_Msk                (3UL << ITM1_TCR_GTSFREQ_Pos)                   /*!< ITM TCR: Global timestamp frequency Mask */

#define ITM1_TCR_TSPrescale_Pos              8U                                            /*!< ITM TCR: TSPrescale Position */
#define ITM1_TCR_TSPrescale_Msk             (3UL << ITM1_TCR_TSPrescale_Pos)                /*!< ITM TCR: TSPrescale Mask */

#define ITM1_TCR_SWOENA_Pos                  4U                                            /*!< ITM TCR: SWOENA Position */
#define ITM1_TCR_SWOENA_Msk                 (1UL << ITM1_TCR_SWOENA_Pos)                    /*!< ITM TCR: SWOENA Mask */

#define ITM1_TCR_DWTENA_Pos                  3U                                            /*!< ITM TCR: DWTENA Position */
#define ITM1_TCR_DWTENA_Msk                 (1UL << ITM1_TCR_DWTENA_Pos)                    /*!< ITM TCR: DWTENA Mask */

#define ITM1_TCR_SYNCENA_Pos                 2U                                            /*!< ITM TCR: SYNCENA Position */
#define ITM1_TCR_SYNCENA_Msk                (1UL << ITM1_TCR_SYNCENA_Pos)                   /*!< ITM TCR: SYNCENA Mask */

#define ITM1_TCR_TSENA_Pos                   1U                                            /*!< ITM TCR: TSENA Position */
#define ITM1_TCR_TSENA_Msk                  (1UL << ITM1_TCR_TSENA_Pos)                     /*!< ITM TCR: TSENA Mask */

#define ITM1_TCR_ITMENA_Pos                  0U                                            /*!< ITM TCR: ITM Enable bit Position */
#define ITM1_TCR_ITMENA_Msk                 (1UL /*<< ITM1_TCR_ITMENA_Pos*/)                /*!< ITM TCR: ITM Enable bit Mask */

/* ITM Integration Write Register Definitions */
#define ITM1_IWR_ATVALIDM_Pos                0U                                            /*!< ITM IWR: ATVALIDM Position */
#define ITM1_IWR_ATVALIDM_Msk               (1UL /*<< ITM1_IWR_ATVALIDM_Pos*/)              /*!< ITM IWR: ATVALIDM Mask */

/* ITM Integration Read Register Definitions */
#define ITM1_IRR_ATREADYM_Pos                0U                                            /*!< ITM IRR: ATREADYM Position */
#define ITM1_IRR_ATREADYM_Msk               (1UL /*<< ITM1_IRR_ATREADYM_Pos*/)              /*!< ITM IRR: ATREADYM Mask */

/* ITM Integration Mode Control Register Definitions */
#define ITM1_IMCR_INTEGRATION_Pos            0U                                            /*!< ITM IMCR: INTEGRATION Position */
#define ITM1_IMCR_INTEGRATION_Msk           (1UL /*<< ITM1_IMCR_INTEGRATION_Pos*/)          /*!< ITM IMCR: INTEGRATION Mask */

/* ITM Lock Status Register Definitions */
#define ITM1_LSR_ByteAcc_Pos                 2U                                            /*!< ITM LSR: ByteAcc Position */
#define ITM1_LSR_ByteAcc_Msk                (1UL << ITM1_LSR_ByteAcc_Pos)                   /*!< ITM LSR: ByteAcc Mask */

#define ITM1_LSR_Access_Pos                  1U                                            /*!< ITM LSR: Access Position */
#define ITM1_LSR_Access_Msk                 (1UL << ITM1_LSR_Access_Pos)                    /*!< ITM LSR: Access Mask */

#define ITM1_LSR_Present_Pos                 0U                                            /*!< ITM LSR: Present Position */
#define ITM1_LSR_Present_Msk                (1UL /*<< ITM1_LSR_Present_Pos*/)               /*!< ITM LSR: Present Mask */
//}}}
//{{{  ITM_Type       0xE0000000
typedef struct {
__OM  union {
    __OM  uint8_t    u8;                 /*!< Offset: 0x000 ( /W)  ITM Stimulus Port 8-bit */
    __OM  uint16_t   u16;                /*!< Offset: 0x000 ( /W)  ITM Stimulus Port 16-bit */
    __OM  uint32_t   u32;                /*!< Offset: 0x000 ( /W)  ITM Stimulus Port 32-bit */
  }  PORT [32U];                         /*!< Offset: 0x000 ( /W)  ITM Stimulus Port Registers */

        uint32_t RESERVED0[864U];
  __IOM uint32_t TER;                    /*!< Offset: 0xE00 (R/W)  ITM Trace Enable Register */
        uint32_t RESERVED1[15U];
  __IOM uint32_t TPR;                    /*!< Offset: 0xE40 (R/W)  ITM Trace Privilege Register */
        uint32_t RESERVED2[15U];
  __IOM uint32_t TCR;                    /*!< Offset: 0xE80 (R/W)  ITM Trace Control Register */
        uint32_t RESERVED3[29U];
  __OM  uint32_t IWR;                    /*!< Offset: 0xEF8 ( /W)  ITM Integration Write Register */
  __IM  uint32_t IRR;                    /*!< Offset: 0xEFC (R/ )  ITM Integration Read Register */
  __IOM uint32_t IMCR;                   /*!< Offset: 0xF00 (R/W)  ITM Integration Mode Control Register */
        uint32_t RESERVED4[43U];
  __OM  uint32_t LAR;                    /*!< Offset: 0xFB0 ( /W)  ITM Lock Access Register */
  __IM  uint32_t LSR;                    /*!< Offset: 0xFB4 (R/ )  ITM Lock Status Register */
        uint32_t RESERVED5[6U];
  __IM  uint32_t PID4;                   /*!< Offset: 0xFD0 (R/ )  ITM Peripheral Identification Register #4 */
  __IM  uint32_t PID5;                   /*!< Offset: 0xFD4 (R/ )  ITM Peripheral Identification Register #5 */
  __IM  uint32_t PID6;                   /*!< Offset: 0xFD8 (R/ )  ITM Peripheral Identification Register #6 */
  __IM  uint32_t PID7;                   /*!< Offset: 0xFDC (R/ )  ITM Peripheral Identification Register #7 */
  __IM  uint32_t PID0;                   /*!< Offset: 0xFE0 (R/ )  ITM Peripheral Identification Register #0 */
  __IM  uint32_t PID1;                   /*!< Offset: 0xFE4 (R/ )  ITM Peripheral Identification Register #1 */
  __IM  uint32_t PID2;                   /*!< Offset: 0xFE8 (R/ )  ITM Peripheral Identification Register #2 */
  __IM  uint32_t PID3;                   /*!< Offset: 0xFEC (R/ )  ITM Peripheral Identification Register #3 */
  __IM  uint32_t CID0;                   /*!< Offset: 0xFF0 (R/ )  ITM Component  Identification Register #0 */
  __IM  uint32_t CID1;                   /*!< Offset: 0xFF4 (R/ )  ITM Component  Identification Register #1 */
  __IM  uint32_t CID2;                   /*!< Offset: 0xFF8 (R/ )  ITM Component  Identification Register #2 */
  __IM  uint32_t CID3;                   /*!< Offset: 0xFFC (R/ )  ITM Component  Identification Register #3 */
} ITM1_Type1;

