colinporth/stm32F429disco/Src/main.cpp
typedef struct {
    __IO uint32_t CR;           /* Main Control Register */
    __IO uint32_t CCR;          /* Configuration Code Register */
    __IO uint32_t TRIGGER;      /* Trigger Event */
    __IO uint32_t ASICCR;       /* ASIC Control Register */
    __IO uint32_t SR;           /* ETM Status Register */
    __IO uint32_t SCR;          /* System Configuration Register */
    __IO uint32_t TSSCR;        /* TraceEnable Start/Stop Control Register */
    __IO uint32_t TECR2;        /* TraceEnable Control 2 */
    __IO uint32_t TEEVR;        /* TraceEnable Event Register */
    __IO uint32_t TECR1;        /* TraceEnable Control 1 */
    __IO uint32_t FFRR;         /* FIFOFULL Region Register */
    __IO uint32_t FFLR;         /* FIFOFULL Level Register */
    __IO uint32_t VDEVR;        /* ViewData Event Register */
    __IO uint32_t VDCR1;        /* ViewData Control 1 */
    __IO uint32_t VDCR2;        /* ViewData Control 2 */
    __IO uint32_t VDCR3;        /* ViewData Control 3 */
    __IO uint32_t ACVR[16];     /* Address Comparator Value Registers */
    __IO uint32_t ACTR[16];     /* Address Comparator Access Type Registers */
    __IO uint32_t DCVR[16];     /* Data Comparator Value Registers */
    __IO uint32_t DCMR[16];     /* Data Comparator Mask Registers */
    __IO uint32_t CNTRLDVR[4];  /* Counter Reload Value Registers */
    __IO uint32_t CNTENR[4];    /* Counter Enable Registers */
    __IO uint32_t CNTRLDEVR[4]; /* Counter Reload Event Registers */
    __IO uint32_t CNTVR[4];     /* Counter Value Registers */
    __IO uint32_t SQabEVR[6];   /* Sequencer State Transition Event Registers */
    __IO uint32_t RESERVED0;
    __IO uint32_t SQR;          /* Current Sequencer State Register */
    __IO uint32_t EXTOUTEVR[4]; /* External Output Event Registers */
    __IO uint32_t CIDCVR[3];    /* Context ID Comparator Value Registers */
    __IO uint32_t CIDCMR;       /* Context ID Comparator Mask Register */
    __IO uint32_t IMPL[8];      /* Implementation specific registers */
    __IO uint32_t SYNCFR;       /* Synchronization Frequency Register */
    __IO uint32_t IDR;          /* ETM ID Register */
    __IO uint32_t CCER;         /* Configuration Code Extension Register */
    __IO uint32_t EXTINSELR;    /* Extended External Input Selection Register */
    __IO uint32_t TESSEICR;     /* TraceEnable Start/Stop EmbeddedICE Control Register */
    __IO uint32_t EIBCR;        /* EmbeddedICE Behavior Control Register */
    __IO uint32_t TSEVR;        /* Timestamp Event Register, ETMv3.5 */
    __IO uint32_t AUXCR;        /* Auxiliary Control Register, ETMv3.5 */
    __IO uint32_t TRACEIDR;     /* CoreSight Trace ID Register */
    __IO uint32_t RESERVED1;
    __IO uint32_t IDR2;         /* ETM ID Register 2 */
    __IO uint32_t RESERVED2[13];
    __IO uint32_t VMIDCVR;      /* VMID Comparator Value Register, ETMv3.5 */
    __IO uint32_t RESERVED3[47];
    __IO uint32_t OSLAR;        /* OS Lock Access Register */
    __IO uint32_t OSLSR;        /* OS Lock Status Register */
    __IO uint32_t OSSRR;        /* OS Save and Restore Register */
    __IO uint32_t RESERVED4;
    __IO uint32_t PDCR;         /* Power Down Control Register, ETMv3.5 */
    __IO uint32_t PDSR;         /* Device Power-Down Status Register */
    __IO uint32_t RESERVED5[762];
    __IO uint32_t ITCTRL;       /* Integration Mode Control Register */
    __IO uint32_t RESERVED6[39];
    __IO uint32_t CLAIMSET;     /* Claim Tag Set Register */
    __IO uint32_t CLAIMCLR;     /* Claim Tag Clear Register */
    __IO uint32_t RESERVED7[2];
    __IO uint32_t LAR;          /* Lock Access Register */
    __IO uint32_t LSR;          /* Lock Status Register */
    __IO uint32_t AUTHSTATUS;   /* Authentication Status Register */
    __IO uint32_t RESERVED8[3];
    __IO uint32_t DEVID;        /* CoreSight Device Configuration Register */
    __IO uint32_t DEVTYPE;      /* CoreSight Device Type Register */
    __IO uint32_t PIDR4;        /* Peripheral ID4 */
    __IO uint32_t PIDR5;        /* Peripheral ID5 */
    __IO uint32_t PIDR6;        /* Peripheral ID6 */
    __IO uint32_t PIDR7;        /* Peripheral ID7 */
    __IO uint32_t PIDR0;        /* Peripheral ID0 */
    __IO uint32_t PIDR1;        /* Peripheral ID1 */
    __IO uint32_t PIDR2;        /* Peripheral ID2 */
    __IO uint32_t PIDR3;        /* Peripheral ID3 */
    __IO uint32_t CIDR0;        /* Component ID0 */
    __IO uint32_t CIDR1;        /* Component ID1 */
    __IO uint32_t CIDR2;        /* Component ID2 */
    __IO uint32_t CIDR3;        /* Component ID3 */
  } ETM_Type;

#define ETM_BASE 0xE0041000
#define ETM ((ETM_Type*)ETM_BASE)
//}}}

//{{{  DBGMCU defines
/********************  Bit definition for DBGMCU1_IDCODE register  *************/
#define DBGMCU1_IDCODE_DEV_ID_Pos                     (0U)
#define DBGMCU1_IDCODE_DEV_ID_Msk                     (0xFFFU << DBGMCU1_IDCODE_DEV_ID_Pos) /*!< 0x00000FFF */
#define DBGMCU1_IDCODE_DEV_ID                         DBGMCU1_IDCODE_DEV_ID_Msk
#define DBGMCU1_IDCODE_REV_ID_Pos                     (16U)
#define DBGMCU1_IDCODE_REV_ID_Msk                     (0xFFFFU << DBGMCU1_IDCODE_REV_ID_Pos) /*!< 0xFFFF0000 */
#define DBGMCU1_IDCODE_REV_ID                         DBGMCU1_IDCODE_REV_ID_Msk

/********************  Bit definition for DBGMCU1_CR register  *****************/
#define DBGMCU1_CR_DBG_SLEEP_Pos                      (0U)
#define DBGMCU1_CR_DBG_SLEEP_Msk                      (0x1U << DBGMCU1_CR_DBG_SLEEP_Pos) /*!< 0x00000001 */
#define DBGMCU1_CR_DBG_SLEEP                          DBGMCU1_CR_DBG_SLEEP_Msk
#define DBGMCU1_CR_DBG_STOP_Pos                       (1U)
#define DBGMCU1_CR_DBG_STOP_Msk                       (0x1U << DBGMCU1_CR_DBG_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU1_CR_DBG_STOP                           DBGMCU1_CR_DBG_STOP_Msk
#define DBGMCU1_CR_DBG_STANDBY_Pos                    (2U)
#define DBGMCU1_CR_DBG_STANDBY_Msk                    (0x1U << DBGMCU1_CR_DBG_STANDBY_Pos) /*!< 0x00000004 */
#define DBGMCU1_CR_DBG_STANDBY                        DBGMCU1_CR_DBG_STANDBY_Msk
#define DBGMCU1_CR_TRACE_IOEN_Pos                     (5U)
#define DBGMCU1_CR_TRACE_IOEN_Msk                     (0x1U << DBGMCU1_CR_TRACE_IOEN_Pos) /*!< 0x00000020 */
#define DBGMCU1_CR_TRACE_IOEN                         DBGMCU1_CR_TRACE_IOEN_Msk

