colinporth/stm32F429disco/Src/main.cpp
#define COL_GREEN         0x07E0
//#define COL_LIGHTGREEN    0xFF80FF80
//#define COL_DARKGREEN     0xFF008000
//#define COL_DARKERGREEN   0xFF004000

#define COL_RED           0xF800
//#define COL_LIGHTRED      0xFFFF8080
//#define COL_DARKRED       0xFF800000

#define COL_CYAN          0x07FF
//#define COL_LIGHTCYAN     0xFF80FFFF
//#define COL_DARKCYAN      0xFF008080

#define COL_MAGENTA       0xF81F
//#define COL_LIGHTMAGENTA  0xFFFF80FF
//#define COL_DARKMAGENTA   0xFF800080

#define COL_YELLOW        0xFFE0
//#define COL_LIGHTYELLOW   0xFFFFFF80
//#define COL_DARKYELLOW    0xFF808000
//#define COL_DARKERYELLOW  0xFF202000

//#define COL_BROWN         0xFFA52A2A
//#define COL_ORANGE        0xFFFFA500
//#define COL_DARKORANGE    0xFFC07800
//#define COL_DARKERORANGE  0xFF805000
//}}}
//{{{  lcd vars
class cLcd;
cLcd* lcd = nullptr;

//{{{  struct tLTDC
typedef struct {
  //SemaphoreHandle_t sem;
  uint32_t timeouts;
  uint32_t lineIrq;
  uint32_t fifoUnderunIrq;
  uint32_t transferErrorIrq;
  uint32_t lastTicks;
  uint32_t lineTicks;
  uint32_t frameWait;
  } tLTDC;
//}}}
tLTDC ltdc;

uint8_t showAlpha[2];
uint32_t showFrameBufferAddress[2];
//}}}

uint16_t getFontHeight() { return 26; }
uint16_t getBigFontHeight() { return 40; }
uint16_t getSmallFontHeight() { return 12; }
uint16_t getBoxHeight() { return 30; }

class cLcd {
public:
  //{{{  class cTile
  class cTile {
  public:
    cTile (uint32_t base, uint16_t pitch, uint16_t format, uint16_t components,
           uint16_t x, uint16_t y, uint16_t width, uint16_t height)
       :  mBase(base), mPitch(pitch), mFormat(format), mComponents(components),
          mX(x), mY(y), mWidth(width), mHeight(height) {};

    uint32_t mBase;
    uint16_t mPitch;
    uint16_t mFormat;
    uint16_t mComponents;
    uint16_t mX;
    uint16_t mY;
    uint16_t mWidth;
    uint16_t mHeight;
    };
  //}}}
  //{{{
  cLcd (uint32_t buffer0, uint32_t buffer1)  {

    mBuffer[false] = buffer0;
    mBuffer[true] = buffer1;
    updateNumDrawLines();
    }
  //}}}
  ~cLcd() {}
  //{{{
  void init (std::string title) {

    mDrawBuffer = !mDrawBuffer;
    ltdcInit (mBuffer[mDrawBuffer]);

    // dma2d IRQ init
    //HAL_NVIC_SetPriority (DMA2D_IRQn, 0x0F, 0);
    //HAL_NVIC_EnableIRQ (DMA2D_IRQn);

    // font init
    FT_Init_FreeType (&FTlibrary);
    FT_New_Memory_Face (FTlibrary, (FT_Byte*)freeSansBold, sizeof (freeSansBold), 0, &FTface);
    FTglyphSlot = FTface->glyph;

    // preload fontChars
    for (char ch = 0x20; ch <= 0x7F; ch++)
      loadChar (getFontHeight(), ch);
    //for (char ch = 0x21; ch <= 0x3F; ch++)
    //  loadChar (getBigFontHeight(), ch);
    //for (char ch = 0x21; ch <= 0x3F; ch++)
    //  loadChar (getSmallFontHeight(), ch);

    FT_Done_Face (FTface);
    //FT_Done_FreeType (FTlibrary);

    mTitle = title;
    updateNumDrawLines();
    }
  //}}}

  uint16_t getWidthPix() { return 800; }
  uint16_t getHeightPix() { return 1280; }

  //{{{
  void setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

    mShowTitle = title;
    mShowInfo = info;
    mShowLcdStats = lcdStats;
    mShowFooter = footer;

    updateNumDrawLines();
    }
  //}}}
  //{{{
  void debug (std::string str) {
    info (COL_WHITE, str);
    render();
    }
  //}}}
  //{{{
  void info (std::string str) {
    info (COL_WHITE, str);
    }
  //}}}
  //{{{
  void info (uint16_t colour, std::string str) {

    bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

    auto line = (mLastLine < mMaxLine-1) ? mLastLine+1 : mLastLine;
    mLines[line].mTime = HAL_GetTick(); //xTaskGetTickCount();
    mLines[line].mColour = colour;
    mLines[line].mString = str;
    mLastLine = line;

    if (tailing)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    }
  //}}}

  //{{{
  void pixel (uint16_t colour, int16_t x, int16_t y) {
    *((uint16_t*)(mCurFrameBufferAddress + ((y * getWidthPix()) + x) * kDstComponents)) = colour;
    }
  //}}}
  //{{{
  void rect (uint16_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {
    ready();
    DMA2D->OCOLR = colour;
    DMA2D->OOR = getWidthPix() - width;
    DMA2D->OMAR = mCurFrameBufferAddress + ((y * getWidthPix()) + x) * kDstComponents; 
    DMA2D->NLR = (width << 16) | height;
    DMA2D->CR = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    mWait = true;
    }
  //}}}
  //{{{
  void rect1 (uint16_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {
    //__IO uint32_t OCOLR;         /*!< DMA2D Output Color Register,                    Address offset: 0x38 */
    //__IO uint32_t OMAR;          /*!< DMA2D Output Memory Address Register,           Address offset: 0x3C */
    //__IO uint32_t OOR;           /*!< DMA2D Output Offset Register,                   Address offset: 0x40 */
    //__IO uint32_t NLR;           /*!< DMA2D Number of Line Register,                  Address offset: 0x44 */
    uint32_t regs[4];
    regs[0] = colour;
    regs[1] = mCurFrameBufferAddress + ((y * getWidthPix()) + x) * kDstComponents;
    regs[2] = getWidthPix() - width;
    regs[3] = (width << 16) | height;

    ready();
    memcpy ((void*)(&DMA2D->OCOLR), regs, 4*4);
    DMA2D->CR = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    mWait = true;
    }
  //}}}
  //{{{
  void stamp (uint16_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    // __IO uint32_t FGMAR;         /*!< DMA2D Foreground Memory Address Register,       Address offset: 0x0C */
    // __IO uint32_t FGOR;          /*!< DMA2D Foreground Offset Register,               Address offset: 0x10 */
    // __IO uint32_t BGMAR;         /*!< DMA2D Background Memory Address Register,       Address offset: 0x14 */
    // __IO uint32_t BGOR;          /*!< DMA2D Background Offset Register,               Address offset: 0x18 */
    // __IO uint32_t FGPFCCR;       /*!< DMA2D Foreground PFC Control Register,          Address offset: 0x1C */
    // __IO uint32_t FGCOLR;        /*!< DMA2D Foreground Color Register,                Address offset: 0x20 */
    // __IO uint32_t BGPFCCR;       /*!< DMA2D Background PFC Control Register,          Address offset: 0x24 */
    // __IO uint32_t BGCOLR;        /*!< DMA2D Background Color Register,                Address offset: 0x28 */
    // __IO uint32_t FGCMAR;        /*!< DMA2D Foreground CLUT Memory Address Register,  Address offset: 0x2C */
    // __IO uint32_t BGCMAR;        /*!< DMA2D Background CLUT Memory Address Register,  Address offset: 0x30 */
    // __IO uint32_t OPFCCR;        /*!< DMA2D Output PFC Control Register,              Address offset: 0x34 */
    // __IO uint32_t OCOLR;         /*!< DMA2D Output Color Register,                    Address offset: 0x38 */
    // __IO uint32_t OMAR;          /*!< DMA2D Output Memory Address Register,           Address offset: 0x3C */
    // __IO uint32_t OOR;           /*!< DMA2D Output Offset Register,                   Address offset: 0x40 */
    //__IO uint32_t NLR;           /*!< DMA2D Number of Line Register,                  Address offset: 0x44 */
    uint32_t regs[15];
    regs[0] = (uint32_t)src;
    regs[1] = 0;
    regs[2] = mCurFrameBufferAddress + ((y * getWidthPix()) + x) * kDstComponents;
    regs[3] = getWidthPix() - width;
    regs[4] = DMA2D_INPUT_A8;
    regs[5] = ((colour & 0xF800) << 8) | ((colour & 0x07E0) << 5) | ((colour & 0x001F) << 3);
    regs[6] = DMA2D_INPUT_RGB565;
    regs[7] = 0;
    regs[8] = 0;
    regs[9] = 0;
    regs[10] = DMA2D_INPUT_RGB565;
    regs[11] = 0;
    regs[12] = regs[2];
    regs[13] = regs[3];
    regs[14] = (width << 16) | height;

    ready();
    memcpy ((void*)(&DMA2D->FGMAR), regs, 15*4);
    DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    mWait = true;
    }

  //}}}
  //{{{
  void stamp1 (uint16_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    uint32_t address = mCurFrameBufferAddress + ((y * getWidthPix()) + x) * kDstComponents;
    uint32_t col = ((colour & 0xF800) << 8) | ((colour & 0x07E0) << 5) | ((colour & 0x001F) << 3);
    uint32_t stride = getWidthPix() - width;
    uint32_t nlr = (width << 16) | height;
    ready();
    DMA2D->FGMAR   = (uint32_t)src;  // fgnd start address
    DMA2D->FGOR    = 0;              // fgnd stride
    DMA2D->BGMAR   = address;        // - repeated to bgnd start addres
    DMA2D->BGOR    = stride;         // - repeated to bgnd stride
    DMA2D->FGPFCCR = DMA2D_INPUT_A8; // fgnd PFC
    DMA2D->FGCOLR  = col;
    DMA2D->BGPFCCR = DMA2D_INPUT_RGB565;
    DMA2D->OPFCCR  = DMA2D_INPUT_RGB565;
    DMA2D->OMAR    = address;        // output start address
    DMA2D->OOR     = stride;         // output stride
    DMA2D->NLR     = nlr;            //  width:height
    DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    mWait = true;
    }
  //}}}
  //{{{
  void copy (cTile& srcTile, int16_t x, int16_t y) {

    ready();
    DMA2D->FGPFCCR = srcTile.mFormat;
    DMA2D->FGMAR = (uint32_t)srcTile.mBase;
    DMA2D->FGOR = srcTile.mPitch - srcTile.mWidth;
    DMA2D->OMAR = mCurFrameBufferAddress + ((y * getWidthPix()) + x) * kDstComponents;
    DMA2D->OOR = getWidthPix() - srcTile.mWidth;
    DMA2D->NLR = (srcTile.mWidth << 16) | srcTile.mHeight;
    DMA2D->CR = DMA2D_M2M_PFC | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    mWait = true;
    }
  //}}}
  //{{{
  void copy90 (cTile& srcTile, int16_t x, int16_t y) {

    ready();
    DMA2D->FGPFCCR = srcTile.mFormat;
    DMA2D->FGOR = 0;
    DMA2D->OOR = getWidthPix() - 1;
    DMA2D->NLR = 0x10000 | (srcTile.mWidth);

    for (int line = 0; line < srcTile.mHeight; line++) {
      DMA2D->FGMAR = (uint32_t)srcTile.mBase + (line * srcTile.mWidth * srcTile.mComponents);
      DMA2D->OMAR = mCurFrameBufferAddress + (line * kDstComponents);
      DMA2D->CR = DMA2D_M2M_PFC | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
      wait();
      }
    }
  //}}}
  //{{{
  void size (cTile& srcTile, int16_t x, int16_t y, uint16_t width, uint16_t height) {
  // 2 passs size with rotates, bilinear blend but broken

    uint32_t tempBuf = (uint32_t)pvPortMalloc (srcTile.mWidth * height * kTempComponents);

