colinporth/stm32F429disco/Src/main.cpp
    // first pass
    uint32_t srcBase = srcTile.mBase + ((srcTile.mY * srcTile.mPitch) + srcTile.mX) * srcTile.mComponents;
    uint32_t blendCoeff = ((srcTile.mHeight-1) << 21) / height;
    uint32_t blendIndex = blendCoeff >> 1;
    uint16_t srcPitch = srcTile.mPitch * srcTile.mComponents;
    uint32_t srcPtr = srcBase + (blendIndex >> 21) * srcPitch;
    uint32_t srcPtr1 = srcPtr + srcPitch;
    uint32_t dstPtr = tempBuf;
    uint32_t fccr = srcTile.mFormat | ((blendIndex >> 13) << 24);
    uint16_t dstPitch = kTempComponents;

    ready();
    DMA2D->FGOR = 0;
    DMA2D->BGPFCCR = 0xff000000 | srcTile.mFormat;
    DMA2D->BGOR = 0;
    DMA2D->OPFCCR = kTempFormat;
    DMA2D->OOR = height - 1;
    DMA2D->NLR = 0x10000 | srcTile.mWidth;
    for (int i = 0; i < height; i++) {
      //{{{  loop lines, src -> temp
      DMA2D->FGPFCCR = fccr;
      DMA2D->FGMAR = srcPtr1;
      DMA2D->BGMAR = srcPtr;
      DMA2D->OMAR = dstPtr;
      DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;

      blendIndex += blendCoeff;
      fccr = srcTile.mFormat | ((blendIndex >> 13) << 24);
      srcPtr = srcBase + (blendIndex >> 21) * srcPitch;
      srcPtr1 = srcPtr + srcPitch;
      dstPtr += dstPitch;

      wait();
      }
      //}}}

    // second pass
    srcBase = tempBuf;
    blendCoeff = ((srcTile.mWidth-1) << 21) / width;
    blendIndex = blendCoeff >> 1;
    srcPitch = height * kTempComponents;
    srcPtr = srcBase + (blendIndex >> 21) * srcPitch;
    srcPtr1 = srcPtr + srcPitch;
    dstPtr = mCurFrameBufferAddress + (((y * getWidthPix()) + x) * kDstComponents);
    fccr = kTempFormat | ((blendIndex >> 13) << 24);
    dstPitch = kDstComponents;

    DMA2D->BGPFCCR = 0xff000000 | kTempFormat;
    DMA2D->OPFCCR  = kDstFormat;
    DMA2D->OOR = width - 1;
    DMA2D->NLR = 0x10000 | height;
    for (int i = 0; i < width; i++) {
      //{{{  loop columns, temp -> dst
      DMA2D->FGPFCCR = fccr;
      DMA2D->FGMAR = srcPtr1;
      DMA2D->BGMAR = srcPtr;
      DMA2D->OMAR = dstPtr;
      DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;

      blendIndex += blendCoeff;
      fccr = kTempFormat | ((blendIndex >> 13) << 24);
      srcPtr = srcBase + (blendIndex >> 21) * srcPitch;
      srcPtr1 = srcPtr + srcPitch;
      dstPtr += dstPitch;

      wait();
      }
      //}}}

    vPortFree ((void*)tempBuf);
    }
  //}}}
  //{{{
  void sizeCpu (cTile& srcTile, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    uint32_t xStep16 = (srcTile.mWidth << 16) / width;
    uint32_t yStep16 = (srcTile.mHeight << 16) / height;

    uint16_t* dstPtr = (uint16_t*)(mCurFrameBufferAddress) + (y * getWidthPix()) + x;

    if (srcTile.mComponents == 2) {
      uint16_t* srcBase = (uint16_t*)(srcTile.mBase) + (srcTile.mY * srcTile.mPitch) + srcTile.mX;
      for (uint32_t y16 = (srcTile.mY << 16); y16 < ((srcTile.mY + height) * yStep16); y16 += yStep16) {
        uint16_t* srcy1x1 = srcBase + (y16 >> 16) * srcTile.mPitch;
        for (uint32_t x16 = srcTile.mX << 16; x16 < (srcTile.mX + width) * xStep16; x16 += xStep16)
          *dstPtr++ = *(srcy1x1 + (x16 >> 16));
        dstPtr += getWidthPix() - width;
        }
      }

    else {
      uint8_t* srcBase = (uint8_t*)(srcTile.mBase + ((srcTile.mY * srcTile.mPitch) + srcTile.mX) * srcTile.mComponents);
      for (uint32_t y16 = (srcTile.mY << 16); y16 < ((srcTile.mY + height) * yStep16); y16 += yStep16) {
        uint8_t* srcy = srcBase + ((y16 >> 16) * srcTile.mPitch) * srcTile.mComponents;
        for (uint32_t x16 = srcTile.mX << 16; x16 < (srcTile.mX + width) * xStep16; x16 += xStep16) {
          uint8_t* srcy1x1 = srcy + (x16 >> 16) * srcTile.mComponents;
          *dstPtr++ = ((*srcy1x1++) >> 3) | (((*srcy1x1++) & 0xFC) << 3) | (((*srcy1x1) & 0xF8) << 8);
          }
        dstPtr += getWidthPix() - width;
        }
      }
    }
  //}}}
  //{{{
  void sizeCpuBiLinear (cTile& srcTile, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    uint32_t xStep16 = ((srcTile.mWidth - 1) << 16) / (width - 1);
    uint32_t yStep16 = ((srcTile.mHeight - 1) << 16) / (height - 1);
    uint16_t* dstPtr = (uint16_t*)(mCurFrameBufferAddress) + (y * getWidthPix()) + x;

    uint32_t ySrcOffset = srcTile.mPitch * srcTile.mComponents;
    for (uint32_t y16 = (srcTile.mY << 16); y16 < (srcTile.mY + height) * yStep16; y16 += yStep16) {
      uint8_t yweight2 = (y16 >> 9) & 0x7F;
      uint8_t yweight1 = 0x80 - yweight2;
      const uint8_t* srcy = (uint8_t*)srcTile.mBase + ((y16 >> 16) * ySrcOffset) + (srcTile.mX * srcTile.mComponents);
      for (uint32_t x16 = srcTile.mX << 16; x16 < (srcTile.mX + width) * xStep16; x16 += xStep16) {
        uint8_t xweight2 = (x16 >> 9) & 0x7F;
        uint8_t xweight1 = 0x80 - xweight2;
        const uint8_t* srcy1x1 = srcy + (x16 >> 16) * srcTile.mComponents;
        const uint8_t* srcy1x2 = srcy1x1 + srcTile.mComponents;
        const uint8_t* srcy2x1 = srcy1x1 + ySrcOffset;
        const uint8_t* srcy2x2 = srcy2x1 + srcTile.mComponents;

        //for (auto dstComponent = 0; dstComponent < 3; dstComponent++)
        *dstPtr++ = ((((*srcy1x1++ * xweight1 + *srcy1x2++ * xweight2) * yweight1) +
                       (*srcy2x1++ * xweight1 + *srcy2x2++ * xweight2) * yweight2) >> 17) |
                    (((((*srcy1x1++ * xweight1 + *srcy1x2++ * xweight2) * yweight1) +
                        (*srcy2x1++ * xweight1 + *srcy2x2++ * xweight2) * yweight2) >> 11) & 0x07E0) |
                    (((((*srcy1x1 * xweight1 + *srcy1x2 * xweight2) * yweight1) +
                        (*srcy2x1 * xweight1 + *srcy2x2 * xweight2) * yweight2) >> 6) & 0xF800);
        }
      }
    }
  //}}}

  //{{{
  void pixelClipped (uint16_t colour, int16_t x, int16_t y) {

      rectClipped (colour, x, y, 1, 1);
    }
  //}}}
  //{{{
  void stampClipped (uint16_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    if (!width || !height || x < 0)
      return;

    if (y < 0) {
      // top clip
      if (y + height <= 0)
        return;
      height += y;
      src += -y * width;
      y = 0;
      }

