colinporth/stm32F429disco/Src/main.cpp
  //{{{
  void startRender() {
    mDrawBuffer = !mDrawBuffer;
    setLayer (0, mBuffer[mDrawBuffer]);
    mDrawStartTime = HAL_GetTick();
    }
  //}}}
  //{{{
  void renderCursor (uint16_t colour, int16_t x, int16_t y, uint16_t z) {
    ellipse (colour, x, y, z, z);
    }
  //}}}
  //{{{
  void endRender (bool forceInfo) {

    auto y = 0;
    if ((mShowTitle || forceInfo) && !mTitle.empty()) {
      //{{{  draw title
      text (COL_YELLOW, getFontHeight(), mTitle, 0, y, getWidthPix(), getBoxHeight());
      y += getBoxHeight();
      }
      //}}}
    if (mShowInfo || forceInfo) {
      //{{{  draw info lines
      if (mLastLine >= 0) {
        // draw scroll bar
        auto yorg = getBoxHeight() + ((int)mFirstLine * mNumDrawLines * getBoxHeight() / (mLastLine + 1));
        auto height = mNumDrawLines * mNumDrawLines * getBoxHeight() / (mLastLine + 1);
        rectClipped (COL_YELLOW, 0, yorg, 8, height);
        }

      auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
      if (lastLine > mLastLine)
        lastLine = mLastLine;

      for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
        auto x = 0;
        auto xinc = text (COL_GREEN, getFontHeight(),
                          dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                          dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'),
                          x, y, getWidthPix(), getBoxHeight());
        x += xinc + 3;

        text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString,
              x, y, getWidthPix()-x, getHeightPix());

        y += getBoxHeight();
        }
      }
      //}}}
    if (mShowLcdStats) {
      //{{{  draw lcdStats
      std::string str = dec (ltdc.lineIrq) + ":f " +
                        dec (ltdc.lineTicks) + "ms " +
                        dec (ltdc.transferErrorIrq) + " " +
                        dec (ltdc.fifoUnderunIrq);
      text (COL_WHITE, getFontHeight(), str, 0, getHeightPix() - 2 * getBoxHeight(), getWidthPix(), 24);
      }
      //}}}
    if (mShowFooter || forceInfo)
      //{{{  draw footer
      text (COL_WHITE, getFontHeight(),
            //dec (xPortGetFreeHeapSize()) + " " +
            //dec (xPortGetMinimumEverFreeHeapSize()) + " " +
            //dec (osGetCPUUsage()) + "% " +
          dec (mDrawTime) + "ms ", 0, -getFontHeight() + getHeightPix(), getWidthPix(), getFontHeight());
      //}}}
    ready();

    // show it
    showLayer (0, mBuffer[mDrawBuffer], 255);

    mDrawTime = HAL_GetTick() - mDrawStartTime;
    }
  //}}}
  //{{{
  void render() {
    startRender();
    clear (COL_BLACK);
    endRender (true);
    }
  //}}}

  //{{{
  void displayOn() {
    GPIOD->BSRR = GPIO_PIN_13;   // ADJ hi
    }
  //}}}
  //{{{
  void displayOff() {
    GPIOD->BSRR = GPIO_PIN_13 << 16;   // ADJ lo
    }
  //}}}
  //{{{
  void press (int pressCount, int16_t x, int16_t y, uint16_t z, int16_t xinc, int16_t yinc) {

    if ((pressCount > 30) && (x <= mStringPos) && (y <= getBoxHeight()))
      reset();
    else if (pressCount == 0) {
      if (x <= mStringPos) {
        // set displayFirstLine
        if (y < 2 * getBoxHeight())
          displayTop();
        else if (y > getHeightPix() - 2 * getBoxHeight())
          displayTail();
        }
      }
    else {
      // inc firstLine
      float value = mFirstLine - ((2.0f * yinc) / getBoxHeight());

      if (value < 0)
        mFirstLine = 0;
      else if (mLastLine <= (int)mNumDrawLines-1)
        mFirstLine = 0;
      else if (value > mLastLine - mNumDrawLines + 1)
        mFirstLine = mLastLine - mNumDrawLines + 1;
      else
        mFirstLine = value;
      }
    }
  //}}}

private:
  //{{{  const
  const uint32_t kLtdcFormat = LTDC_PIXEL_FORMAT_RGB565;

  const uint32_t kDstFormat = DMA2D_RGB565;
  const uint16_t kDstComponents = 2;

  const uint32_t kTempFormat = DMA2D_RGB565;
  const uint16_t kTempComponents = 2;
  //}}}
  //{{{
  class cFontChar {
  public:
    uint8_t* bitmap;
    int16_t left;
    int16_t top;
    int16_t pitch;
    int16_t rows;
    int16_t advance;
    };
  //}}}
  typedef std::map<uint16_t, cFontChar*> cFontCharMap;

  //{{{
  void ltdcInit (uint32_t frameBufferAddress) {

    //{{{  clocks
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();

    __HAL_RCC_DMA2D_CLK_ENABLE();
    __HAL_RCC_LTDC_CLK_ENABLE();
    //}}}
    //{{{  gpio
    //  CK <-> PG.07   DE <-> PF.10  ADJ <-> PD.13 - optional HS <-> PC.06, VS <-> PA.04
    //  R2 <-> PC.10xx G2 <-> PA.06   B2 <-> PD.06
    //  R3 <-> PB.00   G3 <-> PG.10   B3 <-> PG.11
    //  R4 <-> PA.11   G4 <-> PB.10   B4 <-> PG.12
    //  R5 <-> PA.12   G5 <-> PB.11   B5 <-> PA.03
    //  R6 <-> PB.01   G6 <-> PC.07   B6 <-> PB.08
    //  R7 <-> PG.06   G7 <-> PD.03   B7 <-> PB.09

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
    //GPIO_InitStructure.Pull = GPIO_NOPULL;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Pin = GPIO_PIN_13;
    HAL_GPIO_Init (GPIOD, &GPIO_InitStructure);

    GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull = GPIO_NOPULL;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Alternate = GPIO_AF14_LTDC;

    GPIO_InitStructure.Pin = GPIO_PIN_3 | GPIO_PIN_6 | GPIO_PIN_11 | GPIO_PIN_12; // GPIO_PIN_4
    HAL_GPIO_Init (GPIOA, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
    HAL_GPIO_Init (GPIOB, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_7;// ; | GPIO_PIN_10; // GPIO_PIN_6
    HAL_GPIO_Init (GPIOC, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_3 | GPIO_PIN_6;
    HAL_GPIO_Init (GPIOD, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init (GPIOF, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_11;
    HAL_GPIO_Init (GPIOG, &GPIO_InitStructure);

