colinporth/stm32F429disco/Src/main.cpp
  for (int i = 0; i < 8; i++) {
    ps2send (0xED); // send leds
    ps2send (i);
    HAL_Delay (100);
    }

  ps2send (0x0F2); // sendId
  lcd->info ("keyboard id " + hex (ps2get()) + hex(ps2get()));
  }
//}}}
//{{{
void initPs2touchpad() {

  ps2send (0xFF);  // Touchpad reset
  if (ps2get() != 0xAA)
    lcd->info ("initPs2touchpad - missing 0xAA reset");
  if (ps2get() != 0x00)
    lcd->info ("initPs2touchpad - missing 0x00 reset");

  //ps2sendTouchpadSpecialCommand (0x00);
  //ps2send (0xE9); // touchpad statusRequest prefixed by specialCommand
  //auto minor = ps2get();
  //ps2get();  // 0x47
  //auto major = ps2get();
  //lcd->info ("Identify " + hex (major & 0x0F) + "." + hex (minor) + " modelCode:" + hex (major >> 4));

  //ps2sendTouchpadSpecialCommand (0x02);
  //ps2send (0xE9); // touchpad statusRequest prefixed by specialCommand
  //auto capMsb = ps2get();
  //ps2get();  // 0x47
  //auto capLsb = PS2get();
  //lcd->info ("Capabilities " + hex ((capMsb << 8) | capLsb));

  //ps2sendTouchpadSpecialCommand (0x03);
  //ps2send (0xE9); // touchpad statusRequest prefixed by specialCommand
  //ps2send modelId1 = ps2get();
  //auto modelId2 = ps2get();
  //auto modelId3 = ps2get();
  //lcd->info ("ModelId " + hex ((modelId1 << 16) | (modelId2 << 8) | modelId3));

  ps2sendTouchpadSpecialCommand (0x80);
  ps2send (0xF3); // touchpad setSampleRate prefixed by specialCommand
  ps2send (0x14); // - setSampleRate = 20

  ps2send (0xF4); // touchpad enable streaming
  }
//}}}
//}}}
//{{{  Sd
typedef enum { MSD_OK, MSD_ERROR, MSD_ERROR_SD_NOT_PRESENT, MSD_NO_HIGH_SPEED } MSD_RESULT;
//{{{  static vars
SD_HandleTypeDef uSdHandle;
HAL_SD_CardInfoTypedef uSdCardInfo;
DMA_HandleTypeDef dmaRxHandle;
DMA_HandleTypeDef dmaTxHandle;

const uint32_t mReadCacheSize = 0x40;
uint8_t* mReadCache = 0;
uint32_t mReadCacheBlock = 0xFFFFFFB0;
uint32_t mReads = 0;
uint32_t mReadHits = 0;
uint32_t mReadMultipleLen = 0;
uint32_t mReadBlock = 0xFFFFFFFF;

uint32_t mWrites = 0;
int32_t mWriteMultipleLen = 0;
uint32_t mWriteBlock = 0xFFFFFFFF;
//}}}

extern "C" { void SDIO_IRQHandler() { HAL_SD_IRQHandler (&uSdHandle); } }
extern "C" { void DMA2_Stream3_IRQHandler() { HAL_DMA_IRQHandler (uSdHandle.hdmarx); } }
extern "C" { void DMA2_Stream6_IRQHandler() { HAL_DMA_IRQHandler (uSdHandle.hdmatx); } }

//{{{
uint8_t SD_Init() {

  uSdHandle.Instance = SDIO;
  uSdHandle.Init.ClockEdge           = SDIO_CLOCK_EDGE_RISING;
  uSdHandle.Init.ClockBypass         = SDIO_CLOCK_BYPASS_DISABLE;  // SDIO_CLOCK_BYPASS_ENABLE;
  uSdHandle.Init.ClockPowerSave      = SDIO_CLOCK_POWER_SAVE_DISABLE;
  uSdHandle.Init.BusWide             = SDIO_BUS_WIDE_1B;
  uSdHandle.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
  uSdHandle.Init.ClockDiv            = 0;

  __HAL_RCC_SDIO_CLK_ENABLE();
  __HAL_RCC_DMA2_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  //{{{  gpio init
  // sdPresent init - PC6
  GPIO_InitTypeDef gpio_init_structure;
  gpio_init_structure.Pin = GPIO_PIN_6;
  gpio_init_structure.Mode = GPIO_MODE_INPUT;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init (GPIOC, &gpio_init_structure);

  // SDIO D0..D3 - PC8..PC11
  gpio_init_structure.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = GPIO_AF12_SDIO;
  HAL_GPIO_Init (GPIOC, &gpio_init_structure);

  // SDIO CMD - PD2
  gpio_init_structure.Pin = GPIO_PIN_2;
  HAL_GPIO_Init (GPIOD, &gpio_init_structure);

  // SDIO CLK - PC12
  gpio_init_structure.Pin = GPIO_PIN_12;
  //gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init (GPIOC, &gpio_init_structure);
  //}}}
  //{{{  DMA rx parameters
  dmaRxHandle.Instance                 = DMA2_Stream3;
  dmaRxHandle.Init.Channel             = DMA_CHANNEL_4;
  dmaRxHandle.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  dmaRxHandle.Init.PeriphInc           = DMA_PINC_DISABLE;
  dmaRxHandle.Init.MemInc              = DMA_MINC_ENABLE;
  dmaRxHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
  dmaRxHandle.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
  dmaRxHandle.Init.Mode                = DMA_PFCTRL;
  dmaRxHandle.Init.Priority            = DMA_PRIORITY_VERY_HIGH;
  dmaRxHandle.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
  dmaRxHandle.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  dmaRxHandle.Init.MemBurst            = DMA_MBURST_INC4;
  dmaRxHandle.Init.PeriphBurst         = DMA_PBURST_INC4;
  __HAL_LINKDMA (&uSdHandle, hdmarx, dmaRxHandle);
  HAL_DMA_DeInit (&dmaRxHandle);
  HAL_DMA_Init (&dmaRxHandle);
  //}}}
  //{{{  DMA tx parameters
  dmaTxHandle.Instance                 = DMA2_Stream6;
  dmaTxHandle.Init.Channel             = DMA_CHANNEL_4;
  dmaTxHandle.Init.Direction           = DMA_MEMORY_TO_PERIPH;
  dmaTxHandle.Init.PeriphInc           = DMA_PINC_DISABLE;
  dmaTxHandle.Init.MemInc              = DMA_MINC_ENABLE;
  dmaTxHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
  dmaTxHandle.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
  dmaTxHandle.Init.Mode                = DMA_PFCTRL;
  dmaTxHandle.Init.Priority            = DMA_PRIORITY_VERY_HIGH;
  dmaTxHandle.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
  dmaTxHandle.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  dmaTxHandle.Init.MemBurst            = DMA_MBURST_INC4;
  dmaTxHandle.Init.PeriphBurst         = DMA_PBURST_INC4;

  __HAL_LINKDMA (&uSdHandle, hdmatx, dmaTxHandle);
  HAL_DMA_DeInit (&dmaTxHandle);
  HAL_DMA_Init (&dmaTxHandle);
  //}}}

  HAL_NVIC_SetPriority (DMA2_Stream3_IRQn, 6, 0);
  HAL_NVIC_EnableIRQ (DMA2_Stream3_IRQn);
  HAL_NVIC_SetPriority (DMA2_Stream6_IRQn, 6, 0);
  HAL_NVIC_EnableIRQ (DMA2_Stream6_IRQn);

  HAL_NVIC_SetPriority (SDIO_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ (SDIO_IRQn);

  // HAL SD initialization
  if (HAL_SD_Init (&uSdHandle, &uSdCardInfo) != SD_OK)
    return MSD_ERROR;
  if (HAL_SD_WideBusOperation_Config (&uSdHandle, SDIO_BUS_WIDE_4B) != SD_OK)
    return MSD_ERROR;
  if (HAL_SD_HighSpeed (&uSdHandle) == SD_OK)
    lcd->info ("high speed ok");
  return MSD_OK;
  }
//}}}
//{{{
uint8_t SD_ITConfig() {

  //GPIO_InitTypeDef gpio_init_structure;
  //gpio_init_structure.Pin = SD_DETECT_PIN;
  //gpio_init_structure.Pull = GPIO_PULLUP;
  //gpio_init_structure.Speed = GPIO_SPEED_FAST;
  //gpio_init_structure.Mode = GPIO_MODE_IT_RISING_FALLING;
  //HAL_GPIO_Init (SD_DETECT_GPIO_PORT, &gpio_init_structure);

  // Enable and set SD detect EXTI Interrupt to the lowest priority */
  //HAL_NVIC_SetPriority ((IRQn_Type)(SD_DETECT_EXTI_IRQn), 0x0F, 0x00);
  //HAL_NVIC_EnableIRQ ((IRQn_Type)(SD_DETECT_EXTI_IRQn));

  return MSD_OK;
  }
//}}}

