colinporth/stm32F429disco/Src/main.cpp
//{{{
bool SD_present() {
  return !(GPIOC->IDR & GPIO_PIN_6);
  }
//}}}
//{{{
int8_t SD_IsReady() {
  return (SD_present() && (HAL_SD_GetStatus (&uSdHandle) == SD_TRANSFER_OK)) ? 0 : -1;
  }
//}}}
//{{{
int8_t SD_GetCapacity (uint32_t* block_num, uint16_t* block_size) {

  if (SD_present()) {
    HAL_SD_CardInfoTypedef info;
    HAL_SD_Get_CardInfo (&uSdHandle, &info);
    *block_num = (info.CardCapacity) / 512 - 1;
    *block_size = 512;
    return 0;
    }

  return -1;
  }
//}}}

//{{{
HAL_SD_TransferStateTypedef SD_GetStatus() {
  return HAL_SD_GetStatus (&uSdHandle);
  }
//}}}
//{{{
void SD_GetCardInfo (HAL_SD_CardInfoTypedef* CardInfo) {
  HAL_SD_Get_CardInfo (&uSdHandle, CardInfo);
  }
//}}}
//{{{
std::string SD_info() {
  return "r:" + dec (mReadHits) + ":" + dec (mReads) + ":"  + dec (mReadBlock + mReadMultipleLen) +
         " w:" + dec (mWrites);
  }
//}}}

//{{{
uint8_t SD_Read (uint8_t* buf, uint32_t blk_addr, uint16_t blocks) {

  uint32_t tmp = (uint32_t)buf;

  auto result = HAL_SD_ReadBlocks_DMA (&uSdHandle, (uint32_t*)buf, blk_addr * 512, 512, blocks);
  if (result != SD_OK) {
    lcd->debug ("HAL_SD_ReadBlocks_DMA:" + hex (tmp) + " " + dec (blk_addr) + " num:" + dec (blocks) +  dec (result));
    return MSD_ERROR;
    }

  result = HAL_SD_CheckReadOperation (&uSdHandle, 500);
  if (result != SD_OK) {
    lcd->debug ("HAL_SD_CheckReadOperation:" + hex (tmp) + " " + dec (blk_addr) + " num:" + dec (blocks) +  dec (result));
    return MSD_ERROR;
    }
  //SCB_InvalidateDCache_by_Addr ((uint32_t*)((uint32_t)buf & 0xFFFFFFE0), (blocks * 512) + 32);

  return MSD_OK;
  }
//}}}
//{{{
uint8_t SD_Write (uint8_t* buf, uint32_t blk_addr, uint16_t blocks) {

  //if (HAL_SD_WriteBlocks (&uSdHandle, (uint32_t*)buf, blk_addr * 512, blocks) != SD_OK)
  //  return MSD_ERROR;
  //can't remove ?
  HAL_SD_CheckWriteOperation (&uSdHandle, 0xFFFFFFFF);

  return MSD_OK;
  }
//}}}
//{{{
int8_t SD_ReadCached (uint8_t* buf, uint32_t blk_addr, uint16_t blocks) {

  return SD_Read (buf, blk_addr, blocks);
  }
//}}}
//{{{
int8_t SD_WriteCached (uint8_t* buf, uint32_t blk_addr, uint16_t blocks) {

  if (SD_present()) {
    mWrites++;
    SD_Write (buf, blk_addr, blocks);

    mReadCacheBlock = 0xFFFFFFF0;
    if (blk_addr != mWriteBlock + mWriteMultipleLen) {
      if (mWriteMultipleLen) {
        // flush pending multiple
        //cLcd::debug ("wm:" + dec (mWriteBlock) + "::" + dec (mWriteMultipleLen));
        mWriteMultipleLen = 0;
        }
      mWriteBlock = blk_addr;
      }
    mWriteMultipleLen += blocks;

    return 0;
    }

  return -1;
  }
//}}}

//{{{
uint8_t SD_Erase (uint64_t StartAddr, uint64_t EndAddr) {
  if (HAL_SD_Erase (&uSdHandle, StartAddr, EndAddr) != SD_OK)
    return MSD_ERROR;
  else
    return MSD_OK;
  }
//}}}

// diskio
static volatile DSTATUS Stat = STA_NOINIT;
//{{{
DSTATUS diskInitialize() {

  return SD_GetStatus() == SD_TRANSFER_OK ? 0 : STA_NOINIT;
  }
//}}}

//{{{
DSTATUS diskStatus() {

  return SD_GetStatus() == SD_TRANSFER_OK ? 0 : STA_NOINIT;
  }
//}}}
//{{{
DRESULT diskIoctl (BYTE cmd, void* buff) {

  DRESULT res = RES_ERROR;

  switch (cmd) {
    // Make sure that no pending write process
    case CTRL_SYNC :
      res = RES_OK;
      break;

    // Get number of sectors on the disk (DWORD)
    case GET_SECTOR_COUNT : {
      HAL_SD_CardInfoTypedef CardInfo;
      SD_GetCardInfo (&CardInfo);
      *(DWORD*)buff = CardInfo.CardCapacity / SECTOR_SIZE;
      res = RES_OK;
      break;
      }

    // Get R/W sector size (WORD)
    case GET_SECTOR_SIZE :
      *(WORD*)buff = SECTOR_SIZE;
      res = RES_OK;
      break;

    // Get erase block size in unit of sector (DWORD)
    case GET_BLOCK_SIZE :
      *(DWORD*)buff = SECTOR_SIZE;
      res = RES_OK;
      break;

    default:
      res = RES_PARERR;
    }

  return res;
  }
//}}}

//{{{
DRESULT diskRead (BYTE* buffer, DWORD sector, UINT count) {

  if ((uint32_t)buffer & 0x03) {
    lcd->info ("diskRead align b:" + hex ((int)buffer) + " sec:" + dec (sector) + " num:" + dec (count));

    // not 32bit aligned, dma fails,
    auto tempBuffer = (uint8_t*)pvPortMalloc (count * SECTOR_SIZE);

    // read into 32bit aligned tempBuffer
    auto result = SD_ReadCached (tempBuffer, sector, count) == MSD_OK ? RES_OK : RES_ERROR;
    memcpy (buffer, tempBuffer, count * SECTOR_SIZE);

    vPortFree (tempBuffer);
    return result;
    }

  else {
    //lcd->info ("diskRead - sec:" + dec (sector) + " num:" + dec (count));
    return SD_ReadCached ((uint8_t*)buffer, sector, count) == MSD_OK ? RES_OK : RES_ERROR;
    }
  }
//}}}
//{{{
DRESULT diskWrite (const BYTE* buffer, DWORD sector, UINT count) {
  return SD_WriteCached ((uint8_t*)buffer, (uint64_t)(sector * SECTOR_SIZE), count) == MSD_OK ? RES_OK : RES_ERROR;
  }
//}}}
//}}}

std::vector<std::string> mFileNames;
//{{{
void listDirectory (std::string directoryName, std::string ext) {

  cDirectory directory (directoryName);
  if (directory.getError()) {
    //{{{  open error
    lcd->info (COL_RED, "directory open error:"  + dec (directory.getError()));
    return;
    }
    //}}}

  cFileInfo fileInfo;
  while ((directory.find (fileInfo) == FR_OK) && !fileInfo.getEmpty()) {
    if (fileInfo.getBack()) {
      }
    else if (fileInfo.isDirectory()) {
      listDirectory (directoryName + "/" + fileInfo.getName(), ext);
      }
    else if (fileInfo.matchExtension (ext.c_str())) {
      mFileNames.push_back (directoryName + "/" + fileInfo.getName());
      }
    }
  }
//}}}
//{{{
int main() {

  HAL_Init();
  SystemClockConfig180();
  initDebugUart();
  BSP_PB_Init (BUTTON_KEY, BUTTON_MODE_GPIO);
  //configureDtrace4();
  SDRAMgpioInit();
  SDRAMbank1Init();
  SDRAMbank2Init();

  HeapRegion_t xHeapRegions[] = { {(uint8_t*)SDRAM_BANK2_ADDR + 0x400000, 0x400000 }, { nullptr, 0 } };
  heapInit (xHeapRegions);
  //{{{  init frameBuffer
  memset ((void*)SDRAM_BANK2_ADDR, 0, 0x400000);

  lcd = new cLcd (SDRAM_BANK2_ADDR, SDRAM_BANK2_ADDR + 0x200000);
  const std::string kHello = "built " + std::string(__TIME__) + " on " + std::string(__DATE__);
  lcd->init ("stm32F429disco test - " + kHello);
  lcd->displayOn();
  lcd->render();
  //}}}
  if (BSP_PB_GetState (BUTTON_KEY) == GPIO_PIN_SET) {
    //{{{  ps2
    initPs2gpio();
    initPs2touchpad();
    stream = true;
    }
    //}}}
  else {
    //{{{  sd
    if (SD_present()) {
      int ret = SD_Init();
      lcd->debug ("SDinit " + dec(ret));

      cFatFs* fatFs = cFatFs::create();
      if (fatFs->mount() != FR_OK)
        lcd->debug ("fatFs mount problem");
      else
        lcd->debug ("SD label:" + fatFs->getLabel() + " vsn:" + hex (fatFs->getVolumeSerialNumber()) +
                   " freeSectors:" + dec (fatFs->getFreeSectors()));
      listDirectory ("", "JPG");
      }
    else
      lcd->debug ("no SD card");
    }
    //}}}

  for (auto fileStr : mFileNames) {
    auto t0 = HAL_GetTick();
    //{{{  read file and header
    cFile file (fileStr, FA_OPEN_EXISTING | FA_READ);
    auto buf = (uint8_t*)pvPortMalloc (file.getSize());
    auto bytesRead = 0;
    file.read (buf, file.getSize(), bytesRead);
    //}}}
    auto tRead = HAL_GetTick();

