colinporth/stm32F429disco/Src/main.cpp
    cJpegPic* jpeg = new cJpegPic (3, buf);
    //{{{  readHeader, calc scale
    jpeg->readHeader();
    auto width = jpeg->getWidth();
    auto height = jpeg->getHeight();

    // calc scale
    auto scaleShift = 0;
    auto scale = 1;
    while ((scaleShift < 3) &&
           ((width / scale > lcd->getWidthPix()) || (height /scale > lcd->getHeightPix()))) {
      scale *= 2;
      scaleShift++;
      }

    width >>= scaleShift;
    height >>= scaleShift;
    //}}}
    auto tHeader = HAL_GetTick();

    lcd->info (fileStr + " sz:" + dec(file.getSize()) + " " + dec(width) + ":" + dec(height) + ">>" + dec(scaleShift));

    auto decodedPic = jpeg->decodeBody (scaleShift);
    auto tDecode = HAL_GetTick();

    delete (jpeg);
    vPortFree (buf);

    lcd->startRender();
    lcd->clear (COL_BLACK);
    lcd->endRender (true);
    auto tRender = HAL_GetTick();

    cLcd::cTile srcTile ((uint32_t)decodedPic, width, DMA2D_RGB888, 3, 0,0, width, height);  //565
    lcd->copy (srcTile, 0, 0);
    auto tCopy = HAL_GetTick();

    lcd->copy90 (srcTile, 0, 0);
    auto tCopy90 = HAL_GetTick();

    //lcd->size (srcTile, 0, 0, 800, 1024);
    auto tSize = HAL_GetTick();

    lcd->sizeCpu (srcTile, 0, 0, 800, 1280);
    auto tSizeCpu = HAL_GetTick();

    //lcd->sizeCpuBiLinear (srcTile, 0, 0, 800, 1280);
    auto tSizeBiCpu = HAL_GetTick();

    lcd->info ("r:" + dec(tRead-t0) + " h:" + dec(tHeader-tRead) + " d:" + dec(tDecode-tHeader) +
               " c:" + dec(tCopy-tRender) + " c90:" + dec(tCopy90-tCopy) +
               " s:" + dec(tSize-tCopy90) + " sc:" + dec(tSizeCpu-tSize) + " sbc:" + dec(tSizeBiCpu-tSizeCpu));
    vPortFree (decodedPic);
    }

  while (true) {
    lcd->startRender();
    lcd->clear (COL_BLACK);
    //std::string str = "x:" + dec(touchX) + " y:" + dec(touchY) + " z:" + dec(touchZ);
    //lcd->text (COL_YELLOW, getFontHeight(), str, 100, 200, lcd->getWidthPix(), getBoxHeight());
    auto x = lcd->getWidthPix() - ((touchY-1300)/4);
    auto y = lcd->getHeightPix() - ((touchX-1300)/4);
    lcd->ellipse (COL_YELLOW, x, y, touchZ, touchZ);
    lcd->endRender (true);
    //uint16_t value = PS2get();
    //char ch = (char)value;
    //std::string charStr (1, ch);
    //std::string releaseStr = (value & 0x100) ? " release " : " ";
    //lcd->info ("key:" + charStr + releaseStr + hex (value));
    }
  }
//}}}
